knowledge-representation.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Knowledge representation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Knowledge representation"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-08 14:24:30 EDT"/>
<meta name="author" content="Joshua Eckroth"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />

</head>
<body>

<div id="preamble">
<a href="index.html">Home</a> &nbsp; &nbsp;
          <!-- Plupper Button -->
          <div id="plupperButton" style="display: inline;"></div>
          <!-- End of Plupper Button Code -->
          <!-- Plupper Tracking Code -->
          <script src="https://www.google.com/jsapi"></script>
          <script type="text/javascript"
                  src="https://static.plupper.com/js/plupper.js"></script>
          <script type="text/javascript">
            plupper.init("joshuaeckroth@plupper.com");
            plupper.enableCobrowsing();
          </script>
          <!-- End of Plupper Tracking Code -->

</div>

<div id="content">
<h1 class="title">Knowledge representation</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">What is KR?</a>
<ul>
<li><a href="#sec-1-1">A surrogate</a></li>
<li><a href="#sec-1-2">An ontological commitment</a></li>
<li><a href="#sec-1-3">A fragmentary theory of intelligent reasoning</a>
<ul>
<li><a href="#sec-1-3-1">What is intelligent reasoning?</a></li>
<li><a href="#sec-1-3-2">What can we infer from what we know?</a></li>
<li><a href="#sec-1-3-3">What should we infer from what we know?</a></li>
</ul>
</li>
<li><a href="#sec-1-4">A medium for pragmatically efficient computation</a></li>
<li><a href="#sec-1-5">A medium for human expression</a></li>
</ul>
</li>
<li><a href="#sec-2">Making it happen</a>
<ul>
<li><a href="#sec-2-1">Procedural knowledge</a></li>
<li><a href="#sec-2-2">Declarative knowledge</a></li>
<li><a href="#sec-2-3">Our own ontological commitment</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">What is KR?</h2>
<div class="outline-text-2" id="text-1">


<p>
The majority of the following discussion comes from Davis et al.,
&ldquo;<a href="http://www.aaai.org/ojs/index.php/aimagazine/article/viewArticle/1029">What is a knowledge representation?</a>&ldquo;
</p>
<p>
A knowledge representation is:
</p>
<ul>
<li>a <i>surrogate</i> for real-world entities

</li>
<li>an <i>ontological commitment</i> about what kinds of entities are
    relevant

</li>
<li>a <i>fragmentary theory of intelligent reasoning</i>, expressed in
    terms of three components: (1) the KR&rsquo;s idea of what makes
    intelligent reasoning, (2) the inferences that are possible in the
    KR, and (3) the inferences that it &ldquo;recommends&rdquo;

</li>
<li>a <i>medium for pragmatically efficient computation</i>; the KR offers
    guidance for organizing information to facilitate making the
    recommended inferences

</li>
<li>a <i>medium for human expression</i>
</li>
</ul>



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">A surrogate</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Reasoning about the world is an internal process. If an agent wishes
to plan how to assemble a bike then the agent must &ldquo;think&rdquo; about
wheels, chains, handle bars, and so on. These entities must exist in
the agent&rsquo;s &ldquo;mind&rdquo; if it is to think about them. We expect the agent
to be able to <i>plan</i> how to assemble a bicycle without needing to
physically manipulate bicycle parts.
</p>
<p>
Thus, the knowledge representation provides a surrogate for real-world
entities. If the KR is useful, the actions that can be performed
internally (as the agent is &ldquo;thinking&rdquo;) will more-or-less match what
the corresponding real-world actions do to real-world entities. For
example, the agent&rsquo;s understanding of what &ldquo;lock the wheel into the
frame&rdquo; does to a wheel and a frame should match the real world (the
wheel is now stuck to the frame, and if the frame is lifted, the wheel
comes with it, etc.).
</p>
<p>
For any entity (surrogate) in the knowledge representation, we have to
be sure we have a good argument for:
</p>
<ul>
<li>&ldquo;correspondence&rdquo;: what does this entity in the KR represent in
    reality?

</li>
<li>&ldquo;fidelity&rdquo;: how well does it match what it is supposed to
    represent?
</li>
</ul>


<p>
All representations are imperfect; some detail is always left out (for
pragmatic concerns if not oversight). Things can go wrong. Locking the
wheel into the frame may not work on some occasion (say, the frame is
bent). We will never be able to represent all possibilities.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">An ontological commitment</h3>
<div class="outline-text-3" id="text-1-2">


<p>
All representations are imperfect, and details must inevitably be left
out; furthermore we typically do not attempt to represent every
object and fact in the known universe. Thus, whenever we use a
knowledge representation, we are making a (possibly implicit)
commitment to the existence of certain entities and not others. If we
want to build an agent that can assemble and fix bicycles, that agent
presumably has no use for facts about the Napoleonic Wars. So to the
bicycle-fixing agent, those historical facts simply do not exist. It
has no way of thinking about them.
</p>
<p>
Davis, et al. describe this feature of KRs as the &ldquo;focusing&rdquo; or
&ldquo;glasses&rdquo; effect, because the agent is effectively wearing glasses
that limit its focus.
</p>
<blockquote>

<p>The focusing effect is an essential part of what a representation
offers because the complexity of the natural world is overwhelming.
We (and our reasoning machines) need guidance in deciding what in the
world to attend to and what to ignore. The glasses supplied by a
representation can provide this guidance: In telling us what and how
to see, they allow us to cope with what would otherwise be untenable
complexity and detail. (<i>op cit.</i>)
</p>
</blockquote>


<p>
Figuring out what ontological commitments to make, that is, what is
relevant to the agent, is a big problem. Also a problem is giving the
agent an understanding of what is <i>not</i> represented. Assembling a
bicycle in zero gravity is likely much more difficult; so can the
agent just assume it is operating in Earth-like gravity? Why can it
make that assumption? Where <i>is</i> that assumption in the agent&rsquo;s
programming and knowledge?
</p>
<p>
These problems are elucidated by John McCarthy, by way of an example:
</p>
<blockquote>

<p>Three missionaries and three cannibals come to a river. A rowboat that
seats two is available. If the cannibals ever outnumber the
missionaries on either bank of the river, the missionaries will be
eaten. How shall they cross the river?
</p>
<p>
Obviously the puzzler is expected to devise a strategy of rowing the
boat back and forth that gets them all across and avoids disaster
[&hellip;]
</p>
<p>
Imagine giving someone the problem, and after he puzzles for a while,
he suggests going upstream half a mile and crossing on a bridge. &lsquo;What
bridge?&rsquo; you say. &lsquo;No bridge is mentioned in the statement of the
problem.&rsquo; And this dunce replies, &lsquo;Well, they don&rsquo;t say there isn&rsquo;t a
bridge.&rsquo; You look at the English and even at the translation of the
English into first order logic, and you must admit that &lsquo;they don&rsquo;t
say&rsquo; there is no bridge. So you modify the problem to exclude bridges
and pose it again, and the dunce proposes a helicopter, and after you
exclude that, he proposes a winged horse or that the other hang onto
the outside of the boat while two row.
</p>
<p>
You now see that while a dunce, he is an inventive dunce. Despairing
of getting him to accept the problem in the proper puzzler&rsquo;s spirit,
you tell him the solution. To your further annoyance, he attacks your
solution on the grounds that the boat might have a leak or lack
oars. After you rectify that omission from the statement of the
problem, he suggests that a sea monster may swim up the river and may
swallow the boat. Again you are frustrated, and you look for a mode of
reasoning that will settle his hash once and for all. &mdash; J. McCarthy,
&ldquo;<a href="http://cogprints.org/410/">Circumscription&mdash;A form of non-monotonic reasoning</a>,&rdquo; 1980
</p>
</blockquote>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">A fragmentary theory of intelligent reasoning</h3>
<div class="outline-text-3" id="text-1-3">


<p>
The reason we build and employ knowledge representations is to
facilitate inferencing or reasoning that&rsquo;s intelligent. The KR embeds
a theory of intelligent reasoning. This theory is fragmentary because
we have (so far) been unable to build a KR, with an accompanying
inferencing procedure, that captures all intelligent reasoning. One
might be able to argue that, in principle, building such a complete
theory is impossible.
</p>
<p>
There are three fundamental questions related to a KR&rsquo;s embedded
theory of intelligent reasoning:
</p>

</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">What is intelligent reasoning?</h4>
<div class="outline-text-4" id="text-1-3-1">


<p>
The field of AI has discovered/invented many varieties of intelligent
reasoning. We have deduction (which is what we&rsquo;ll study), induction,
abduction, reasoning by analogy, probabilistic reasoning, case-based
reasoning, etc. Each of these are closely related to certain knowledge
representation data structures.
</p>
</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">What can we infer from what we know?</h4>
<div class="outline-text-4" id="text-1-3-2">


<p>
Deduction famously cannot yield any new facts; a deductive conclusion
does not state anything more than what was already present in the
premises. However, inducation and abduction, for example, are
&ldquo;ampliative&rdquo; forms of reasoning because they offer new facts (which
may be wrong; deduction, on the other hand, is never wrong).
</p>
<p>
If we want ampliative inference, we have to keep this in mind as we
build the knowledge representation. In this case, deduction cannot be
our only inference tool.
</p>
</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">What should we infer from what we know?</h4>
<div class="outline-text-4" id="text-1-3-3">


<p>
Often the set of inferences available to use is enormous. Which just a
handful of premises and the method of deduction, we can often deduce
many irrelevant facts. How does the agent guide the inference process
so that it can meet certain goals?
</p>
</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">A medium for pragmatically efficient computation</h3>
<div class="outline-text-3" id="text-1-4">


<p>
AI systems must eventually <i>do</i> something; they must compute. So, we
need our knowledge representation to be computationally
pragmatic. It&rsquo;s easy to think up knowledge representations that are
simple, beautiful, precise, and&hellip; unwieldy. The tricks for making a
KR useful but also pragmatic can be quite sophisticated. We&rsquo;ll avoid
dealing with this issue. However, when we look at <a href="./prolog.html">Prolog</a>, it is
important for us to keep in mind that Prolog is useful precisely
because it limits the expressivitiy of the KR in order to keep the
inferencing computationally efficient.
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">A medium for human expression</h3>
<div class="outline-text-3" id="text-1-5">


<blockquote>

<p>If the representation makes things possible but not easy, then as real
users we might never know whether we misunderstood the representation
and just do not know how to use it or whether it truly cannot express
some things that we would like to say. A representation is the
language in which we communicate; hence, we must be able to speak it
without heroic effort.
</p>
</blockquote>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Making it happen</h2>
<div class="outline-text-2" id="text-2">


<p>
Recall that AI problems are best designed and studied at the
&ldquo;knowledge level&rdquo; (see related <a href="./knowledge-level.html">lecture notes</a>). This is because AI
problems are knowledge problems (how to know what to do). Whether an
AI problem is solved primarily with array operations coded in Java or
list operations coded in Lisp is not highly relevant at the knowledge
level.
</p>
<p>
However, when we actually create systems that solve AI problems, we do
have to decide how everything is coded (assuming we are solving the
problem with software). There are at least two ways to represent
knowledge.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Procedural knowledge</h3>
<div class="outline-text-3" id="text-2-1">


<p>
This is the form of knowledge with which you are probably most
familiar. Procedural knowledge is, essentially, a program. If you want
to give your robot knowledge about how to navigate a maze, you write
code to navigate a maze. This code will probably first find the
locations of nearby walls and exits, and make a choice about where to
move based on criteria embedded in the algorithm.
</p>
<p>
In another case, an industrial robot may be programmed to perform a
certain sequence of actions (maybe with a few variations depending on
context), such as assembling part of a car. The &ldquo;knowledge&rdquo; is
embedded in the procedure (the algorithm).
</p>
<p>
Compare this description of procedural knowledge with the way
cognitive pyschologists describe procedural knowledge: they say that
procedural knowledge includes recognition of a face or reacting to a
joke. For them, it is &ldquo;tacit&rdquo; knowledge because it cannot be described
by the person who has it; exactly what knowledge is brought to bear is
not conscious to the agent. This is similar to our description because
knowledge that is embedded in an algorithm likewise is very difficult
to extract and explicate outside of its active use.
</p>
<p>
Note that our prior work with the 8-puzzle used procedural knowledge:
the board states were generated based on an algorithm; there was no
separate &ldquo;description of a board&rdquo; that we consulted.
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Declarative knowledge</h3>
<div class="outline-text-3" id="text-2-2">


<p>
Knowledge that is explicitly represented separately of its use is
declarative knowledge. &ldquo;I declare that such-and-such is the case!&rdquo; It
is knowledge that is true independently of how it happens to be used
in some context.
</p>
<p>
Procedural knowledge is generally specific to the algorithm in which
it is embedded. Thus, there has been less of a drive to create
&ldquo;universal&rdquo; ways of representing procedural knowledge (well, perhaps
we can think of programming languages as universal representations of
procedural knowledge).
</p>
<p>
On the other hand, declarative knowledge, being essentially universal
in nature (not tied to a particular active context like procedural
knowledge is), has experienced centuries of formalization. If we want
to say something universal, perhaps we should have a universal way of
saying it!
</p>
<p>
We&rsquo;ll look at four ways of &ldquo;saying&rdquo; declarative knowledge, each more
sophisticated than the last. We&rsquo;ll explicitly note that these forms of
logic have nothing to do with programming (nothing to do with
procedures). However, in order to actually build software with
declarative knowledge, we&rsquo;ll next look at a programming language that
sort-of approximates a certain logical formalism.
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Our own ontological commitment</h3>
<div class="outline-text-3" id="text-2-3">


<p>
Although we will be using logic (specifically, Boolean, propositional,
and first order logics) for our knowledge representations,
this is not the only approach we could have taken. For example, we
could instead have looked at &ldquo;connectionist&rdquo; representations, which
store knowledge in artificial neural networks (arguably like how our
brains store knowledge). Or, we could have used probabilistic
represenations such as Bayesian networks. The logic approach, however,
is the oldest in AI and generally the easiest to understand.
</p></div>
</div>
</div>
</div>

</body>
</html>
